### Import Pandas Library

In [1]:
import pandas as pd

### Read data from provided CSV file

In [25]:
df = pd.read_csv("tips.csv")

### Display the type of Data

In [38]:
type(df)

pandas.core.frame.DataFrame

### Display columns of Data Frame

In [27]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

### Extract and display the first few rows of the following columns 
    - Total_Bill
    - Tip
    - Sex

In [28]:
df[['total_bill','tip','sex']].head(7)

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       21.01  3.50    Male
3       23.68  3.31    Male
4       24.59  3.61  Female
5       25.29  4.71    Male
6        8.77  2.00    Male

### Display and Sort values of Day and Total_Bill in Descending Order

In [29]:
df.sort_values(['day','total_bill'],ascending=False)[['day','total_bill']]

      day  total_bill
197  Thur       43.11
142  Thur       41.19
85   Thur       34.83
141  Thur       34.30
83   Thur       32.68
..    ...         ...
97    Fri       12.03
100   Fri       11.35
226   Fri       10.09
222   Fri        8.58
92    Fri        5.75

[244 rows x 2 columns]

### Display Unique Days from Data

In [30]:
df['day'].unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

### Change the Value of Tip in Second Row to '2' and Display the Data

In [31]:
df['tip'].iloc[1] = 2
df

C:\Users\Zubair\AppData\Local\Temp\ipykernel_5472\2587182006.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['tip'].iloc[1] = 2

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  2.00    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

### Add new column "TOTAL" = Total Bill + Tip

In [32]:
df['Total']= df['total_bill'] + df['tip']
df

     total_bill   tip     sex smoker   day    time  size  Total
0         16.99  1.01  Female     No   Sun  Dinner     2  18.00
1         10.34  2.00    Male     No   Sun  Dinner     3  12.34
2         21.01  3.50    Male     No   Sun  Dinner     3  24.51
3         23.68  3.31    Male     No   Sun  Dinner     2  26.99
4         24.59  3.61  Female     No   Sun  Dinner     4  28.20
..          ...   ...     ...    ...   ...     ...   ...    ...
239       29.03  5.92    Male     No   Sat  Dinner     3  34.95
240       27.18  2.00  Female    Yes   Sat  Dinner     2  29.18
241       22.67  2.00    Male    Yes   Sat  Dinner     2  24.67
242       17.82  1.75    Male     No   Sat  Dinner     2  19.57
243       18.78  3.00  Female     No  Thur  Dinner     2  21.78

[244 rows x 8 columns]

### Store the names of columns in "Cols" variable

In [35]:
cols = df.columns
cols

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size', 'Total'], dtype='object')

### Create a List (tmp) of Column in following order
### 6, 2, 4, 5

In [36]:
tmp = [cols[5],cols[1],cols[3],cols[4]]
tmp

['time', 'tip', 'smoker', 'day']

### Create a new Dataframe with Columns from 'Tmp'

In [37]:
new_df = df[tmp]
new_df

       time   tip smoker   day
0    Dinner  1.01     No   Sun
1    Dinner  2.00     No   Sun
2    Dinner  3.50     No   Sun
3    Dinner  3.31     No   Sun
4    Dinner  3.61     No   Sun
..      ...   ...    ...   ...
239  Dinner  5.92     No   Sat
240  Dinner  2.00    Yes   Sat
241  Dinner  2.00    Yes   Sat
242  Dinner  1.75     No   Sat
243  Dinner  3.00     No  Thur

[244 rows x 4 columns]